blog/2019-02-09/making-a-blog-with-rust-and-orgmode.org
#+AUTHOR: David Briggs
#+TITLE: Making a Blog with Rust and Org-Mode
#+TAGS: rust tera org-mode
#+OPTIONS: html-style:nil num:nil
<2019-02-09 Sat>
#+ATTR_HTML: target="_blank" 

* The joys of Rust, Tera, and CSS

I've been meaning to use the [[https://dpbriggs.ca][dpbriggs.ca]] domain for a while now,
and I wanted to keep learning Rust, so this blog was born.
I'm happy with the result, but by god, it was a journey.
This article will detail the challenges and successes of making this website.
For reference, it's built with:

1. [[https://rocket.rs/][Rocket]] 🚀 (Rust Web Framework)
2. [[https://github.com/Keats/tera][Tera]] (Fast templating language/engine, similar to Jinja2)
3. [[https://getbootstrap.com/][Bootstrap]] (CSS framework)

And the steps taken, ordered by pain:
1. Getting the CSS/templates looking right =(~5 hours)=
2. Making the rust blog portions and testing them =(~4 hours)=
3. Getting Google Cloud Platform/Cloudflare setup =(~3 hours)=
4. Learning how Rocket, Bootstrap, and Tera works =(~2 hours)=
5. Further modifying emacs to /work/ better =(~2 hours)=
6. Setting up my VM, and not fork bombing it =(~1 hour)=

So by my estimate, it took about ~17 hours of real work to get it built and deployed.
If I had spent more time on step 4, the other steps may have gone faster 🤷.

So, let's get into making the website.

We'll cover the basics, then model the website in Rust,
then make the Tera Templates + CSS, and then finally deploy it in production.

** Getting Started

Rocket makes it pretty quick to get a website started. The simplest rocket project would involve:

0 - Making sure you're on a nightly toolchain:

#+begin_src bash
 ➜  rustup toolchain install nightly
 ➜  rustup default nightly
#+end_src

1 - Making a new project

#+begin_src bash
 ➜  cargo new my-rocket
#+end_src

2 - Adding rocket to =my-rocket/Cargo.toml=

#+begin_src toml
[dependencies]
rocket = "0.4.0"
#+end_src

3 - Adding the rocket route & server launch in =my-rocket/src/main.rs=

#+begin_src rust
#![feature(proc_macro_hygiene, decl_macro)]
#[macro_use]
extern crate rocket;

#[get("/")]
fn hello() -> &'static str {
    "Hello, world!"
}

fn main() {
    rocket::ignite().mount("/", routes![hello]).launch();
}
#+end_src

4 - Running the project (=cargo run=), and view =localhost:8000= in a browser (or just curl it) (images aren't supported yet 😅)

#+begin_src bash
➜ curl localhost:8000
Hello, world!%
#+end_src

(the =%= is just indicating there's no newline at the end)

** Actually Making the Site

There's three pieces to talk about here: Rust/Rocket, Tera/Bootstrap, and Production.

1. For Rust/Rocket, we'll need to figure out how to *represent* the website, and then *wire* things together.
2. For Tera/Bootsrap, we'll need to figure out to *make* and *style* the content.
3. For Production, we'll need to figure how to *get certs* for HTTPS, and how to *serve* our content.

If you just want the code, you can take it from the [[https://github.com/dpbriggs/dpbriggs-blog/tree/ea5a970b7bab785ea663d4bd623dbc5527e17c23][first commit]] of this website.

