blog/2019-02-09/making-a-blog-with-rust-and-orgmode.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-10 Sun 13:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Making a Blog with Rust and Org-Mode</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="David Briggs" />
</head>
<body>
<div id="content">
<h1 class="title">Making a Blog with Rust and Org-Mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf3ab434">The joys of Rust, Tera, and CSS</a>
<ul>
<li><a href="#orgc185981">Getting Started</a></li>
<li><a href="#orgcc13451">Actually Making the Site</a>
<ul>
<li><a href="#org62fa9e3">Representing the website with Rocket/Rust</a></li>
<li><a href="#orgc0e7ea8">Templating With Tera &amp; Bootstrap</a></li>
<li><a href="#org3a6008a">Production</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<span class="timestamp-wrapper"><span class="timestamp">&lt;2019-02-09 Sat&gt;</span></span>
</p>

<div id="outline-container-orgf3ab434" class="outline-2">
<h2 id="orgf3ab434">The joys of Rust, Tera, and CSS</h2>
<div class="outline-text-2" id="text-orgf3ab434">
<p>
I've been meaning to use the <a href="https://dpbriggs.ca">dpbriggs.ca</a> domain for a while now,
and I wanted to keep learning Rust, so this blog was born.
I'm happy with the result, but by god, it was a journey.
This article will detail the challenges and successes of making this website.
For reference, it's built with:
</p>

<ol class="org-ol">
<li><a href="https://rocket.rs/">Rocket</a> 🚀 (Rust Web Framework)</li>
<li><a href="https://github.com/Keats/tera">Tera</a> (Fast templating language/engine, similar to Jinja2)</li>
<li><a href="https://getbootstrap.com/">Bootstrap</a> (CSS framework)</li>
</ol>

<p>
And the steps taken, ordered by pain:
</p>
<ol class="org-ol">
<li>Getting the CSS/templates looking right <code>(~5 hours)</code></li>
<li>Making the rust blog portions and testing them <code>(~4 hours)</code></li>
<li>Getting Google Cloud Platform/Cloudflare setup <code>(~3 hours)</code></li>
<li>Learning how Rocket, Bootstrap, and Tera works <code>(~2 hours)</code></li>
<li>Further modifying emacs to <i>work</i> better <code>(~2 hours)</code></li>
<li>Setting up my VM, and not fork bombing it <code>(~1 hour)</code></li>
</ol>

<p>
So by my estimate, it took about ~17 hours of real work to get it built and deployed.
If I had spent more time on step 4, the other steps may have gone faster 🤷.
</p>

<p>
So, let's get into making the website.
</p>

<p>
We'll cover the basics, then model the website in Rust,
then make the Tera Templates + CSS, and then finally deploy it in production.
</p>
</div>

<div id="outline-container-orgc185981" class="outline-3">
<h3 id="orgc185981">Getting Started</h3>
<div class="outline-text-3" id="text-orgc185981">
<p>
Rocket makes it pretty quick to get a website started. The simplest rocket project would involve:
</p>

<p>
0 - Making sure you're on a nightly toolchain:
</p>

<div class="org-src-container">
<pre class="src src-bash">&#10140;  rustup toolchain install nightly
&#10140;  rustup default nightly
</pre>
</div>

<p>
1 - Making a new project
</p>

<div class="org-src-container">
<pre class="src src-bash">&#10140;  cargo new my-rocket
</pre>
</div>

<p>
2 - Adding rocket to <code>my-rocket/Cargo.toml</code>
</p>

<div class="org-src-container">
<pre class="src src-toml">[<span style="color: #84ffff;">dependencies</span>]
<span style="color: #ffcc80;">rocket</span> = <span style="color: #9ccc65;">"0.4.0"</span>
</pre>
</div>

<p>
3 - Adding the rocket route &amp; server launch in <code>my-rocket/src/main.rs</code>
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#!</span><span style="color: #e91e63;">[</span><span style="color: #ffd700;">feature</span><span style="color: #2196F3;">(</span><span style="color: #ffd700;">proc_macro_hygiene, decl_macro</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">]</span>
<span style="color: #ffd700;">#</span><span style="color: #e91e63;">[</span><span style="color: #ffd700;">macro_use</span><span style="color: #e91e63;">]</span>
<span style="color: #fff59d;">extern</span> <span style="color: #fff59d;">crate</span> rocket;

<span style="color: #ffd700;">#</span><span style="color: #e91e63;">[</span><span style="color: #ffd700;">get</span><span style="color: #2196F3;">(</span><span style="color: #9ccc65;">"/"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">]</span>
<span style="color: #fff59d;">fn</span> <span style="color: #84ffff;">hello</span><span style="color: #e91e63;">()</span> -&gt; &amp;'<span style="color: #fff59d;">static</span> <span style="color: #84ffff;">str</span> <span style="color: #e91e63;">{</span>
    <span style="color: #9ccc65;">"Hello, world!"</span>
<span style="color: #e91e63;">}</span>

<span style="color: #fff59d;">fn</span> <span style="color: #84ffff;">main</span><span style="color: #e91e63;">()</span> <span style="color: #e91e63;">{</span>
    <span style="color: #8bc34a;">rocket</span>::ignite<span style="color: #2196F3;">()</span>.mount<span style="color: #2196F3;">(</span><span style="color: #9ccc65;">"/"</span>, <span style="color: #ffd700;">routes!</span><span style="color: #EF6C00;">[</span>hello<span style="color: #EF6C00;">]</span><span style="color: #2196F3;">)</span>.launch<span style="color: #2196F3;">()</span>;
<span style="color: #e91e63;">}</span>
</pre>
</div>

<p>
4 - Running the project (<code>cargo run</code>), and view <code>localhost:8000</code> in a browser (or just curl it) (images aren't supported yet 😅)
</p>

<div class="org-src-container">
<pre class="src src-bash">&#10140; curl localhost:8000
Hello, world!%
</pre>
</div>

<p>
(the <code>%</code> is just indicating there's no newline at the end)
</p>
</div>
</div>

<div id="outline-container-orgcc13451" class="outline-3">
<h3 id="orgcc13451">Actually Making the Site</h3>
<div class="outline-text-3" id="text-orgcc13451">
<p>
There's three pieces to talk about here: Rust/Rocket, Tera/Bootstrap, and Production.
</p>

<ol class="org-ol">
<li>For Rust/Rocket, we'll need to figure out how to <b>represent</b> the website, and then <b>wire</b> things together.</li>
<li>For Tera/Bootsrap, we'll need to figure out to <b>make</b> and <b>style</b> the content.</li>
<li>For Production, we'll need to figure how to <b>get certs</b> for HTTPS, and how to <b>serve</b> our content.</li>
</ol>

<p>
If you just want the code, you can take it from the <a href="https://github.com/dpbriggs/dpbriggs-blog/tree/ea5a970b7bab785ea663d4bd623dbc5527e17c23">first commit</a> of this website.
</p>
</div>
