blog/2019-02-09/making-a-blog-with-rust-and-orgmode.org
*** Representing the website with Rocket/Rust

As this website is mostly static, this part is pretty easy. There's six easy pieces:

1. =blog.rs= to parse our org HTML files.
2. =context.rs= to store all things context (eg. site name, my email, etc).
3. =routes.rs= to map URLs to functions.
4. =server.rs= to setup rocket & present it to =main.rs=.
5. =main.rs= to be an entrypoint, and start the Rocket server.
6. =tests.rs= to test our site and make sure its working right.

The [[https://github.com/dpbriggs/dpbriggs-blog/tree/master/src][code]] should be easy enough to understand, but lets look at the most important bit is =SiteContext=:

#+begin_src rust
/// SiteContext represents the entire context required to render
/// this website. See [get_base_context](crate::context::get_base_context)
#[derive(Serialize, Debug)]
pub struct SiteContext<'a> {
    /// base is the static key-value context of the website.
    /// All of the information in base comes from
    /// [STATIC_SITE_CONTEXT_KV](crate::context::STATIC_SITE_CONTEXT_KV)
    pub base: &'static SiteContextKv,
    /// kv is the dynamic key-value context of the website.
    pub kv: SiteContextKv,
    /// blog is all blog related items, see [OrgBlog](crate::context::OrgBlog)
    pub blog: &'static OrgBlog,
    /// curr_blog is the current blog article, if applicable.
    pub curr_blog: Option<&'a OrgModeHtml>,
}
#+end_src

An instance of this struct is passed to every page. The page then uses the constituent parts
to render different things. For example, the links in the navbar at the top use =base=
to set the =hrefs=, and actually link you to other parts of the site.

Most routes then look like this:

#+begin_src rust
#[get("/blog")]
fn blog_index() -> Template {
    let context = get_base_context("/blog");
    Template::render(get_template("/blog"), context)
}
#+end_src

We tell rocket to call this function when it sees =/blog=.
The function then gets the base context for =/blog=, and renders the =/blog= template.

Note that special care was taken to move most of the =David Briggs= specific stuff to =context.rs=.
So if you want to fork this site, you can do more or less edit that (and the templates).

As there the org-mode parsing libraries weren't quite what I wanted, I ended up parsing
the exported org html. I just grab the major sections and stick them into =OrgModeHtml=.
Eventually I'll either make my own parser or pray someone else does.

