blog/2019-02-09/making-a-blog-with-rust-and-orgmode.html

<div id="outline-container-org62fa9e3" class="outline-4">
<h4 id="org62fa9e3">Representing the website with Rocket/Rust</h4>
<div class="outline-text-4" id="text-org62fa9e3">
<p>
As this website is mostly static, this part is pretty easy. There's six easy pieces:
</p>

<ol class="org-ol">
<li><code>blog.rs</code> to parse our org HTML files.</li>
<li><code>context.rs</code> to store all things context (eg. site name, my email, etc).</li>
<li><code>routes.rs</code> to map URLs to functions.</li>
<li><code>server.rs</code> to setup rocket &amp; present it to <code>main.rs</code>.</li>
<li><code>main.rs</code> to be an entrypoint, and start the Rocket server.</li>
<li><code>tests.rs</code> to test our site and make sure its working right.</li>
</ol>

<p>
The <a href="https://github.com/dpbriggs/dpbriggs-blog/tree/master/src">code</a> should be easy enough to understand, but lets look at the most important bit is <code>SiteContext</code>:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffe4b5;">/// SiteContext represents the entire context required to render</span>
<span style="color: #ffe4b5;">/// this website. See [get_base_context](crate::context::get_base_context)</span>
<span style="color: #ffd700;">#</span><span style="color: #e91e63;">[</span><span style="color: #ffd700;">derive</span><span style="color: #2196F3;">(</span><span style="color: #ffd700;">Serialize, Debug</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">]</span>
<span style="color: #fff59d;">pub</span> <span style="color: #fff59d;">struct</span> <span style="color: #84ffff;">SiteContext</span><span style="color: #e91e63;">&lt;</span>'<span style="color: #ffcc80;">a</span><span style="color: #e91e63;">&gt;</span> <span style="color: #e91e63;">{</span>
    <span style="color: #ffe4b5;">/// base is the static key-value context of the website.</span>
    <span style="color: #ffe4b5;">/// All of the information in base comes from</span>
    <span style="color: #ffe4b5;">/// [STATIC_SITE_CONTEXT_KV](crate::context::STATIC_SITE_CONTEXT_KV)</span>
    <span style="color: #fff59d;">pub</span> <span style="color: #ffcc80;">base</span>: &amp;'<span style="color: #fff59d;">static</span> <span style="color: #84ffff;">SiteContextKv</span>,
    <span style="color: #ffe4b5;">/// kv is the dynamic key-value context of the website.</span>
    <span style="color: #fff59d;">pub</span> <span style="color: #ffcc80;">kv</span>: <span style="color: #84ffff;">SiteContextKv</span>,
    <span style="color: #ffe4b5;">/// blog is all blog related items, see [OrgBlog](crate::context::OrgBlog)</span>
    <span style="color: #fff59d;">pub</span> <span style="color: #ffcc80;">blog</span>: &amp;'<span style="color: #fff59d;">static</span> <span style="color: #84ffff;">OrgBlog</span>,
    <span style="color: #ffe4b5;">/// curr_blog is the current blog article, if applicable.</span>
    <span style="color: #fff59d;">pub</span> <span style="color: #ffcc80;">curr_blog</span>: <span style="color: #84ffff;">Option</span><span style="color: #2196F3;">&lt;</span>&amp;'<span style="color: #ffcc80;">a</span> <span style="color: #84ffff;">OrgModeHtml</span><span style="color: #2196F3;">&gt;</span>,
<span style="color: #e91e63;">}</span>
</pre>
</div>

<p>
An instance of this struct is passed to every page. The page then uses the constituent parts
to render different things. For example, the links in the navbar at the top use <code>base</code>
to set the <code>hrefs</code>, and actually link you to other parts of the site.
</p>

<p>
Most routes then look like this:
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #ffd700;">#</span><span style="color: #e91e63;">[</span><span style="color: #ffd700;">get</span><span style="color: #2196F3;">(</span><span style="color: #9ccc65;">"/blog"</span><span style="color: #2196F3;">)</span><span style="color: #e91e63;">]</span>
<span style="color: #fff59d;">fn</span> <span style="color: #84ffff;">blog_index</span><span style="color: #e91e63;">()</span> -&gt; <span style="color: #84ffff;">Template</span> <span style="color: #e91e63;">{</span>
    <span style="color: #fff59d;">let</span> <span style="color: #ffcc80;">context</span> = get_base_context<span style="color: #2196F3;">(</span><span style="color: #9ccc65;">"/blog"</span><span style="color: #2196F3;">)</span>;
    <span style="color: #84ffff;">Template</span>::render<span style="color: #2196F3;">(</span>get_template<span style="color: #EF6C00;">(</span><span style="color: #9ccc65;">"/blog"</span><span style="color: #EF6C00;">)</span>, context<span style="color: #2196F3;">)</span>
<span style="color: #e91e63;">}</span>
</pre>
</div>

<p>
We tell rocket to call this function when it sees <code>/blog</code>.
The function then gets the base context for <code>/blog</code>, and renders the <code>/blog</code> template.
</p>

<p>
Note that special care was taken to move most of the <code>David Briggs</code> specific stuff to <code>context.rs</code>.
So if you want to fork this site, you can do more or less edit that (and the templates).
</p>

<p>
As there the org-mode parsing libraries weren't quite what I wanted, I ended up parsing
the exported org html. I just grab the major sections and stick them into <code>OrgModeHtml</code>.
Eventually I'll either make my own parser or pray someone else does.
</p>
</div>
</div>
