blog/2019-02-09/making-a-blog-with-rust-and-orgmode.org
*** Templating With Tera & Bootstrap

Tera is a django style templating engine for HTML.
It lets us conditionally render our HTML (among other things).
This can let us do things like underline /blog/ in the navbar above.
There's a variable which tracks the URL path above and navbar uses it to
underline the relevant section.


Tera has a bunch of features, but the key ones are:

1. Extending templates to add/adapt content generically (think: sidebar & main content)
2. Including templates for always present content (think: HTML head & navbar)

Currently, the root document in this website is:

#+CAPTION: =templates/base.html.tera=
#+begin_src html
<!doctype html>
<html>
    <head>
        {% include "head" %}
    </head>
    <body>
        <div>
        </div>
            {% include "navbar" %}

            {% block content %}
            {% endblock content %}

            {% include "scripts" %}
        </div>
    </body>
</html>
#+end_src

We see that =head=, =navbar=, and =scripts= are always present.
This makes sense for this mostly static website.

The block =content= is more interesting.
It doesn't actually do anything here, but we can extend =base.html.tera=
and define the block in other files to add content.

So lets extend it, by making the skeleton for this blog article:

#+CAPTION: =templates/blog/blog_base.html.tera=
#+begin_src html
{% extends "base" %}

{% block content %}
<div class="container-fluid blog-font">
    <div class="row">
        <nav class="col-md-3 … whole bunch o css …">
            <div class="sidebar-sticky monospace">
                <ul class="nav flex-column">
                    <div class="… whole bunch o css …">
                        {% block blog_sidebar_title %}
                        {% endblock blog_sidebar_title %}
                    </div>
                    {% block blogsidebar %}
                    {% endblock blogsidebar %}
                </ul>
            </div>
        </nav>

        <main role="main" class="col-md-9 ml-sm-auto px-4">
            <div class="… whole hunch o css …">
                {% block blog_title %}
                {% endblock blog_title %}
            </div>
            <div class="float-left blog-article">
                {% block blogcontent %}
                {% endblock blogcontent %}
            </div>
        </main>
    </div>
</div>
{% endblock content %}
#+end_src

Now, you may be thinking =thats a whole lot of spaghetti David=, and you're right, but lets read through this.

First, we =extend base=, which lets =Tera= know which file to use when rendering the HTML.

Next, we redefine ={% block content %}= so =Tera= can copy/paste the stuff in it into =base.html.tera=.
We use bootstrap here to define two vertical sections (see =col-md-2= and =col-md-10=).
That's the sidebar to the left, and the blog you're currently reading on the right.

We also define some more blocks, which we'll finally extend to make the blog content:

#+CAPTION: =templates/blog/blog_article.html.tera=
#+begin_src html
  {% extends "blog/blog_base" %}

  <!-- -------------------- Title -------------------- -->

  {% block blog_title %}
  <h4 class="monospace">{{ curr_blog.title }} ({{ curr_blog.date }})</h4>
  {% endblock blog_title %}

  <!-- -------------------- Sidebar -------------------- -->

  {% block blog_sidebar_title %}
  <h6 class="monospace">Table of Contents </h6>
  {% endblock blog_sidebar_title %}

  {% block blogsidebar %}

  <ul class="nav flex-column">
      {{ curr_blog.toc | safe }}
  </ul>

  {% endblock blogsidebar %}

  <!-- -------------------- Content -------------------- -->

  {% block blogcontent %}

  <div class="container bordered">
      {{ curr_blog.html | safe }}
  </div>

  {% endblock blogcontent %}
#+end_src

Phew, we've made it. This is the stuff that renders what you're currently reading.

As before, we are extending another file (=blog/blog_base=) and filling in blocks.

The ={{ blog.xyz }}= bits are variable expansion. Rocket passes a struct containing the information for this blog (we saw this above),
and we insert it into the document. The ={{ xyz | safe }}= tells Tera not to escape the HTML given.

For example, notice how we've filled in =blogcontent= with ={ curr_blog.html | safe }}=.
That's me, you're reading. That's the org-mode HTML main content.

But that's enough on this topic, lets get this thing in production!

