blog/2019-02-09/making-a-blog-with-rust-and-orgmode.html

<div id="outline-container-orgc0e7ea8" class="outline-4">
<h4 id="orgc0e7ea8">Templating With Tera &amp; Bootstrap</h4>
<div class="outline-text-4" id="text-orgc0e7ea8">
<p>
Tera is a django style templating engine for HTML.
It lets us conditionally render our HTML (among other things).
This can let us do things like underline <i>blog</i> in the navbar above.
There's a variable which tracks the URL path above and navbar uses it to
underline the relevant section.
</p>


<p>
Tera has a bunch of features, but the key ones are:
</p>

<ol class="org-ol">
<li>Extending templates to add/adapt content generically (think: sidebar &amp; main content)</li>
<li>Including templates for always present content (think: HTML head &amp; navbar)</li>
</ol>

<p>
Currently, the root document in this website is:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span><code>templates/base.html.tera</code></label><pre class="src src-html"><span style="color: #9ccc65;">&lt;!doctype html&gt;</span>
&lt;<span style="color: #84ffff;">html</span>&gt;
    &lt;<span style="color: #84ffff;">head</span>&gt;
        {% include <span style="color: #9ccc65;">"head"</span> %}
    &lt;/<span style="color: #84ffff;">head</span>&gt;
    &lt;<span style="color: #84ffff;">body</span>&gt;
        &lt;<span style="color: #84ffff;">div</span>&gt;
        &lt;/<span style="color: #84ffff;">div</span>&gt;
            {% include <span style="color: #9ccc65;">"navbar"</span> %}

            {% block content %}
            {% endblock content %}

            {% include <span style="color: #9ccc65;">"scripts"</span> %}
        &lt;/<span style="color: #84ffff;">div</span>&gt;
    &lt;/<span style="color: #84ffff;">body</span>&gt;
&lt;/<span style="color: #84ffff;">html</span>&gt;
</pre>
</div>

<p>
We see that <code>head</code>, <code>navbar</code>, and <code>scripts</code> are always present.
This makes sense for this mostly static website.
</p>

<p>
The block <code>content</code> is more interesting.
It doesn't actually do anything here, but we can extend <code>base.html.tera</code>
and define the block in other files to add content.
</p>

<p>
So lets extend it, by making the skeleton for this blog article:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 2: </span><code>templates/blog/blog_base.html.tera</code></label><pre class="src src-html">{% extends <span style="color: #9ccc65;">"base"</span> %}

{% block content %}
&lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"container-fluid blog-font"</span>&gt;
    &lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"row"</span>&gt;
        &lt;<span style="color: #84ffff;">nav</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"col-md-3 &#8230; whole bunch o css &#8230;"</span>&gt;
            &lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"sidebar-sticky monospace"</span>&gt;
                &lt;<span style="color: #84ffff;">ul</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"nav flex-column"</span>&gt;
                    &lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"&#8230; whole bunch o css &#8230;"</span>&gt;
                        {% block blog_sidebar_title %}
                        {% endblock blog_sidebar_title %}
                    &lt;/<span style="color: #84ffff;">div</span>&gt;
                    {% block blogsidebar %}
                    {% endblock blogsidebar %}
                &lt;/<span style="color: #84ffff;">ul</span>&gt;
            &lt;/<span style="color: #84ffff;">div</span>&gt;
        &lt;/<span style="color: #84ffff;">nav</span>&gt;

        &lt;<span style="color: #84ffff;">main</span> <span style="color: #ffcc80;">role</span>=<span style="color: #9ccc65;">"main"</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"col-md-9 ml-sm-auto px-4"</span>&gt;
            &lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"&#8230; whole hunch o css &#8230;"</span>&gt;
                {% block blog_title %}
                {% endblock blog_title %}
            &lt;/<span style="color: #84ffff;">div</span>&gt;
            &lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"float-left blog-article"</span>&gt;
                {% block blogcontent %}
                {% endblock blogcontent %}
            &lt;/<span style="color: #84ffff;">div</span>&gt;
        &lt;/<span style="color: #84ffff;">main</span>&gt;
    &lt;/<span style="color: #84ffff;">div</span>&gt;
&lt;/<span style="color: #84ffff;">div</span>&gt;
{% endblock content %}
</pre>
</div>

<p>
Now, you may be thinking <code>thats a whole lot of spaghetti David</code>, and you're right, but lets read through this.
</p>

<p>
First, we <code>extend base</code>, which lets <code>Tera</code> know which file to use when rendering the HTML.
</p>

<p>
Next, we redefine <code>{% block content %}</code> so <code>Tera</code> can copy/paste the stuff in it into <code>base.html.tera</code>.
We use bootstrap here to define two vertical sections (see <code>col-md-2</code> and <code>col-md-10</code>).
That's the sidebar to the left, and the blog you're currently reading on the right.
</p>

<p>
We also define some more blocks, which we'll finally extend to make the blog content:
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 3: </span><code>templates/blog/blog_article.html.tera</code></label><pre class="src src-html">{% extends <span style="color: #9ccc65;">"blog/blog_base"</span> %}

<span style="color: #b0bec5;">&lt;!-- </span><span style="color: #b0bec5;">-------------------- Title -------------------- </span><span style="color: #b0bec5;">--&gt;</span>

{% block blog_title %}
&lt;<span style="color: #84ffff;">h4</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"monospace"</span>&gt;<span style="text-decoration: underline;">{{ curr_blog.title }} ({{ curr_blog.date }})</span>&lt;/<span style="color: #84ffff;">h4</span>&gt;
{% endblock blog_title %}

<span style="color: #b0bec5;">&lt;!-- </span><span style="color: #b0bec5;">-------------------- Sidebar -------------------- </span><span style="color: #b0bec5;">--&gt;</span>

{% block blog_sidebar_title %}
&lt;<span style="color: #84ffff;">h6</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"monospace"</span>&gt;<span style="text-decoration: underline;">Table of Contents </span>&lt;/<span style="color: #84ffff;">h6</span>&gt;
{% endblock blog_sidebar_title %}

{% block blogsidebar %}

&lt;<span style="color: #84ffff;">ul</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"nav flex-column"</span>&gt;
    {{ curr_blog.toc | safe }}
&lt;/<span style="color: #84ffff;">ul</span>&gt;

{% endblock blogsidebar %}

<span style="color: #b0bec5;">&lt;!-- </span><span style="color: #b0bec5;">-------------------- Content -------------------- </span><span style="color: #b0bec5;">--&gt;</span>

{% block blogcontent %}

&lt;<span style="color: #84ffff;">div</span> <span style="color: #ffcc80;">class</span>=<span style="color: #9ccc65;">"container bordered"</span>&gt;
    {{ curr_blog.html | safe }}
&lt;/<span style="color: #84ffff;">div</span>&gt;

{% endblock blogcontent %}
</pre>
</div>

<p>
Phew, we've made it. This is the stuff that renders what you're currently reading.
</p>

<p>
As before, we are extending another file (<code>blog/blog_base</code>) and filling in blocks.
</p>

<p>
The <code>{{ blog.xyz }}</code> bits are variable expansion. Rocket passes a struct containing the information for this blog (we saw this above),
and we insert it into the document. The <code>{{ xyz | safe }}</code> tells Tera not to escape the HTML given.
</p>

<p>
For example, notice how we've filled in <code>blogcontent</code> with <code>{ curr_blog.html | safe }}</code>.
That's me, you're reading. That's the org-mode HTML main content.
</p>

<p>
But that's enough on this topic, lets get this thing in production!
</p>
</div>
</div>
