blog/2019-02-09/making-a-blog-with-rust-and-orgmode.org
*** Production

This part is actually pretty easy. I use [[https://caddyserver.com/][Caddy]] to serve the content as it makes getting certs ridiculously easy.

The entire production configuration is just:

#+begin_src Caddyfile
dpbriggs.ca www.dpbriggs.ca

gzip

proxy / localhost:8000

tls {
    dns cloudflare
}
#+end_src

The important bits are the first line (=dpbriggs.ca www.dpbriggs.ca=) and the =proxy= line.

Caddy uses the domain along with [[https://letsencrypt.org/][Lets Encrypt]] to get certs for HTTPS.
It then proxies Rocket, forwarding all request to =localhost:8000=.

On the VM I just have two =tmux= sessions, one which holds Caddy and the other holds Rocket.

Then the process to deploy the site is:

1. =cargo test= and =git push=
2. =git pull= to get the latest stuff 
3. =cargo build --release=
4. =tmux attach -t 0= and =./run_site.sh=
5. =tmux attach -t 5= and =./run_caddy.sh=

I tried at one point to automatically update the website, but the hot-reloading process
more-or-less fork bombed my server. What would happen is the hot-reload script would =git pull=
my website, =pkill -USR1 caddy= to reload it. But the git stuff takes time and happens in a subprocess,
so this would end up spawning many, many processes. I actually had to run =sudo kill -9 …= in a loop to kill them.

I then ran my website through Googles [[https://developers.google.com/speed/pagespeed/insights/][Page Speed Tool]] and got a lower score, so I setup [[https://www.cloudflare.com/en-ca/][CloudFlare]].
The process was surprising easy, and ended up saving me money by not using Googles Cloud DNS.
I'm now at 96/100, which is good enough for now.

And we're deployed. That's it ™

Thanks for reading,

David Briggs (=email@dpbriggs.ca=)
