blog/2019-02-09/making-a-blog-with-rust-and-orgmode.html

<div id="outline-container-org3a6008a" class="outline-4">
<h4 id="org3a6008a">Production</h4>
<div class="outline-text-4" id="text-org3a6008a">
<p>
This part is actually pretty easy. I use <a href="https://caddyserver.com/">Caddy</a> to serve the content as it makes getting certs ridiculously easy.
</p>

<p>
The entire production configuration is just:
</p>

<div class="org-src-container">
<pre class="src src-Caddyfile">dpbriggs.ca www.dpbriggs.ca

gzip

proxy / localhost:8000

tls {
    dns cloudflare
}
</pre>
</div>

<p>
The important bits are the first line (<code>dpbriggs.ca www.dpbriggs.ca</code>) and the <code>proxy</code> line.
</p>

<p>
Caddy uses the domain along with <a href="https://letsencrypt.org/">Lets Encrypt</a> to get certs for HTTPS.
It then proxies Rocket, forwarding all request to <code>localhost:8000</code>.
</p>

<p>
On the VM I just have two <code>tmux</code> sessions, one which holds Caddy and the other holds Rocket.
</p>

<p>
Then the process to deploy the site is:
</p>

<ol class="org-ol">
<li><code>cargo test</code> and <code>git push</code></li>
<li><code>git pull</code> to get the latest stuff</li>
<li><code>cargo build --release</code></li>
<li><code>tmux attach -t 0</code> and <code>./run_site.sh</code></li>
<li><code>tmux attach -t 5</code> and <code>./run_caddy.sh</code></li>
</ol>

<p>
I tried at one point to automatically update the website, but the hot-reloading process
more-or-less fork bombed my server. What would happen is the hot-reload script would <code>git pull</code>
my website, <code>pkill -USR1 caddy</code> to reload it. But the git stuff takes time and happens in a subprocess,
so this would end up spawning many, many processes. I actually had to run <code>sudo kill -9 …</code> in a loop to kill them.
</p>

<p>
I then ran my website through Googles <a href="https://developers.google.com/speed/pagespeed/insights/">Page Speed Tool</a> and got a lower score, so I setup <a href="https://www.cloudflare.com/en-ca/">CloudFlare</a>.
The process was surprising easy, and ended up saving me money by not using Googles Cloud DNS.
I'm now at 96/100, which is good enough for now.
</p>

<p>
And we're deployed. That's it ™
</p>

<p>
Thanks for reading,
</p>

<p>
David Briggs (<code>email@dpbriggs.ca</code>)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: David Briggs</p>
<p class="date">Created: 2019-02-10 Sun 13:33</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
